Tekla.Structures.ModelInternal.dotGuideline_t
Struct for the Leg face.

Tekla.Structures.ModelInternal.dotGuideline_t.Id
Database id.

Tekla.Structures.ModelInternal.dotGuideline_t.StartExtend
Extend at the start.

Tekla.Structures.ModelInternal.dotGuideline_t.EndExtend
Extend at the end.

Tekla.Structures.ModelInternal.dotGuideline_t.Curve
The geometric curve of the guideline.

Tekla.Structures.ModelInternal.dotGuideline_t.Spacing
The sapcing on this guideline.